app/Controllers/Admin/Productos.php

SELECT *
FROM `productos`
WHERE `productos`.`id` = '6'
---
    public function editar($id)
    {
        $producto = $this->productoModel->find($id);

UPDATE `productos` SET `nombre` = 'sistema de billar', `categoria_id` = '1', `precio` = '30.000', `precio_oferta` = '249.99', `stock` = '0', `descripcion` = 'Sistema punto de venta completo con inventario, facturación y reportes', `imagen_principal` = 'pos-system.jpg', `estado` = 'activo', `mas_vendido` = 1, `fecha_actualizacion` = '2025-11-19 17:59:02'
WHERE `productos`.`id` IN ('1')
---
    public function actualizar($id)
    {
        $data = [
            'nombre' => $this->request->getPost('nombre'),
            'categoria_id' => $this->request->getPost('categoria_id'),
            'precio' => $this->request->getPost('precio'),
            'precio_oferta' => $this->request->getPost('precio_oferta') ?: null,
            'stock' => $this->request->getPost('stock'),
            'descripcion' => $this->request->getPost('descripcion'),
            'imagen_principal' => $this->request->getPost('imagen_principal'),
            'estado' => $this->request->getPost('estado'),
            'mas_vendido' => $this->request->getPost('mas_vendido') ? 1 : 0
        ];

        $this->productoModel->update($id, $data);