app/Models/CategoriaModel.php

SELECT *
FROM `categorias`
WHERE `estado` = 'activo'
---
    public function getCategoriasActivas()
    {
        return $this->where('estado', 'activo')->findAll();

SELECT `categorias`.*, COUNT(productos.id) as total_productos
FROM `categorias`
LEFT JOIN `productos` ON `productos`.`categoria_id` = `categorias`.`id`
GROUP BY `categorias`.`id`
---
    public function getCategoriasConProductos()
    {
        return $this->select('categorias.*, COUNT(productos.id) as total_productos')
                    ->join('productos', 'productos.categoria_id = categorias.id', 'left')
                    ->groupBy('categorias.id')
                    ->findAll();