app/Models/ProductoModel.php

    public function getProductosConCategoria()
    {
        return $this->select('productos.*, categorias.nombre as categoria_nombre')
            ->join('categorias', 'categorias.id = productos.categoria_id')
            ->where('productos.estado', 'activo')
            ->findAll();
---
SELECT `productos`.*, `categorias`.`nombre` as `categoria_nombre`
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
WHERE `productos`.`estado` = 'activo'